anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F23QI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MDR_WWDG</name>
            <version>1.0</version>
            <description>WWDG</description>
            <groupName>WWDG</groupName>
            <baseAddress>0x40048000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDG_IRQ</name>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR</name>
                    <description>WWDG Command Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>T</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDGA</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFR</name>
                    <description>WWDG Configuration Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003FF</resetMask>
                    <fields>
                        <field>
                            <name>W</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WGTB</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EWI</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>WWDG Status Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>EWIF</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>MDR_IWDG</name>
            <version>1.0</version>
            <description>IWDG</description>
            <groupName>IWDG</groupName>
            <baseAddress>0x40050000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KR</name>
                    <description>IWDG Key Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PR</name>
                    <description>IWDG Clock Prescaler Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>PR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLR</name>
                    <description>IWDG Reload Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000FFF</resetMask>
                    <fields>
                        <field>
                            <name>RLR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>IWDG Status Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>PVU</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RVU</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
