anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32F2xQI/MDR32F23QI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MDR_ADCUI</name>
            <version>1.0</version>
            <description>Energy Counter Block</description>
            <groupName>ADCUI</groupName>
            <baseAddress>0x40068000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x124</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADCUI_IRQ</name>
                <value>14</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <description>ADCUI Control1 Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xF83FBFC3</resetMask>
                    <fields>
                        <field>
                            <name>I0EN</name>
                            <description>I0 channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>V0EN</name>
                            <description>V0 channel enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3EN</name>
                            <description>I3 channel enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESOL</name>
                            <description>Data resolution</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>16bit</name>
                                    <description>16 bit data</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24bit</name>
                                    <description>24 bit data</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ZXLPF</name>
                            <description>V0 cross zero LPF enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PER_LENGTH</name>
                            <description>Period to calc aver period and dPhase</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Period_1</name>
                                    <description>1 period</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_2</name>
                                    <description>2 periods</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_4</name>
                                    <description>4 periods</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_8</name>
                                    <description>8 periods</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_16</name>
                                    <description>16 periods</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_32</name>
                                    <description>32 periods</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_64</name>
                                    <description>64 periods</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Period_128</name>
                                    <description>128 periods</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>APNOLOAD</name>
                            <description>No load mode when calculating active energy</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>All</name>
                                    <description>Accumulate All Energy</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Ignore_Less_1p2basis</name>
                                    <description>Ignore Energy less than 0.012% of full scale</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Ignore_Less_0p61basis</name>
                                    <description>Ignore Energy less than 0.0061% of full scale</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Ignore_Less_0p305basis</name>
                                    <description>Ignore Energy less than 0.00305% of full scale</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="APNOLOAD">
                            <name>VARNOLOAD</name>
                            <description>No load mode when calculating reactive energy</description>
                            <bitOffset>15</bitOffset>
                        </field>
                        <field derivedFrom="APNOLOAD">
                            <name>VANOLOAD</name>
                            <description>No load mode when calculating full energy</description>
                            <bitOffset>17</bitOffset>
                        </field>
                        <field>
                            <name>FREQSEL</name>
                            <description>Enable V0 period detection to FxMD0.PER_FREQ</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Off</name>
                                    <description>Hold Last value</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>On</name>
                                    <description>Enabled</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>VREF_SEL</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Internal</name>
                                    <description>Internal Vref source</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>External</name>
                                    <description>External Vref source</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BUF_BYP</name>
                            <description>Bypass Vref buffer</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZXRMS</name>
                            <description>RMS Update mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Continuous</name>
                                    <description>Continuous RMS update</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OnCrossZeroV0</name>
                                    <description>Update on V0 cross zero level</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESET_DIG</name>
                            <description>Digital Logic Reset</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IBOOST</name>
                            <description>Boost ADCUI current</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OSR_CONF</name>
                            <description>ADC Output Sampling Rate</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>4kHz</name>
                                    <description>Sampling at 4kHz</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8kHz</name>
                                    <description>Sampling at 8kHz</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16kHz</name>
                                    <description>Sampling at 16kHz</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <description>ADCUI Control2 Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SAGLVL</name>
                            <description>The level of permitted voltage drop</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>SAGCYC</name>
                            <description>Number of voltage half periods to calc voltage drop level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL3</name>
                    <description>ADCUI Control3 Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000FFF</resetMask>
                    <fields>
                        <field>
                            <name>ZTXOUT</name>
                            <description>Voltage cross zero timeout</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0CTR</name>
                    <description>F0CTR register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>I0NTEN</name>
                            <description>I0 integrator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I3NTEN</name>
                            <description>I3 integrator enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VASEL</name>
                            <description>Select source for FullEnergy</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FullEnergy</name>
                                    <description>I0DAT and VDAT can store FullEnergy</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I_RMS</name>
                                    <description>I0DAT and VDAT can store I_RMS</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RARS</name>
                            <description>Active Energy Accumulator Reset</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RRRS</name>
                            <description>Reactive Energy Accumulator Reset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RVRS</name>
                            <description>Full Energy Accumulator Reset</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>I0GAIN</name>
                            <description>PGA value</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>x1</name>
                                    <description>Signal amplification 0dB</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x2</name>
                                    <description>Signal amplification 6dB</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x4</name>
                                    <description>Signal amplification 12dB</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>x8</name>
                                    <description>Signal amplification 18dB</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field derivedFrom="I0GAIN">
                            <name>VGAIN</name>
                            <bitOffset>8</bitOffset>
                        </field>
                        <field>
                            <name>VPHASE</name>
                            <description>Phase V0 adjustment by step of +-124us</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field derivedFrom="I0GAIN">
                            <name>I3GAIN</name>
                            <bitOffset>18</bitOffset>
                        </field>
                        <field>
                            <name>IRMSOS</name>
                            <description>RMS calibration of channel I</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WC</name>
                    <description>Active energy calibration</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WATTOS</name>
                            <description>Calibration bias of active energy</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>WGAIN</name>
                            <description>Calibration gain of active energy</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTP</name>
                    <description>Positive Active Energy accumulator</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WATTHRP</name>
                            <description>High 32 bits of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTN</name>
                    <description>Negative Active Energy accumulator</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WATTHRN</name>
                            <description>High 32 bits of 57-bits Accumulator</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
